// Copyright (c) Parbad. All rights reserved.
// Licensed under the GNU GENERAL PUBLIC License, Version 3.0. See License.txt in the project root for license information.

using Parbad.Options;

namespace Parbad.Gateway.ZarinPal.Internal;

internal static class ZarinPalCodeTranslator
{
    public static string Translate(int status, MessagesOptions options)
    {
        return status switch
        {
            100 => "عملیات موفق",
            101 => "تراکنش وریفای شده",
            -9  => "خطای اعتبار سنجی",
            -10 => "ای پی و يا مرچنت كد پذيرنده صحيح نيست",
            -11 => "مرچنت کد فعال نیست لطفا با تیم پشتیبانی ما تماس بگیرید",
            -12 => "تلاش بیش از حد در یک بازه زمانی کوتاه.",
            -13 => "محدودیت تراکنش، برای رفع مشکل با پشتیبانی زرین‌پال تماس بگیرید",
            -14 => "دامنه کال‌بک با دامنه ثبت شده درگاه مطابقت ندارد",
            -15 => "ترمینال شما به حالت تعلیق در آمده با تیم پشتیبانی تماس بگیرید",
            -16 => "سطح تاييد پذيرنده پايين تر از سطح نقره اي است.",
            -17 => "سطح پذیرنده در سطح آبی است، امکان تراکنش وجود ندارد",
            -18 => "استفاده از کد درگاه اختصاصی فقط بر روی دامنه ثبت‌شده مجاز است",
            -19 => "امکان ایجاد تراکنش برای این ترمینال وجود ندارد",
            -30 => "اجازه دسترسی به تسویه اشتراکی شناور ندارید",
            -31 => "حساب بانکی تسویه را به پنل اضافه کنید مقادیر وارد شده واسه تسهیم درست نیست",
            -32 => "مبلغ تسهیم‌شده از مبلغ کل تراکنش بیشتر است",
            -33 => "درصد های وارد شده درست نیست",
            -34 => "مبلغ از کل تراکنش بیشتر است",
            -35 => "تعداد افراد دریافت کننده تسهیم بیش از حد مجاز است",
            -36 => "حداقل مبلغ جهت تسهیم باید 10,000 ریال باشد",
            -37 => "یک یا چند شماره شبای وارد شده برای تسهیم از سمت بانک غیرفعال است",
            -38 => "عدم تعریف صحیح شماره شبا، لطفاً دقایقی دیگر تلاش کنید",
            -39 => "خطا در فرآیند تسهیم، لطفاً با پشتیبانی تماس بگیرید",
            -41 => "حداکثر مبلغ پرداختی 100 میلیون تومان است",
            -40 => "پارامترهای اضافی (extra params) نامعتبر هستند",
            -50 => "مبلغ پرداخت شده با مقدار مبلغ در وریفای متفاوت است",
            -51 => "پرداخت ناموفق",
            -52 => "خطای غیر منتظره با پشتیبانی تماس بگیرید",
            -53 => "اتوریتی برای این مرچنت کد نیست",
            -54 => "اتوریتی نامعتبر است",
            -55 => "تراکنش مورد نظر یافت نشد",
            -60 => "امکان ریورس کردن تراکنش با بانک وجود ندارد",
            -61 => "تراکنش موفق نیست یا قبلاً ریورس شده است",
            -62 => "آی‌پی درگاه تنظیم نشده است",
            -63 => "مهلت ۳۰ دقیقه‌ای برای ریورس این تراکنش منقضی شده است",
            _   => $"{options.UnexpectedErrorText} Response: {status}"
        };
    }
}
